{
    "steps": [
    
      {
         "popup": {
             "content_pt": "<p class=\"tooltipTitle\">Configuração</p>Vamos alterar as propriedades desta fonte de dados!",
             "content_en": "<p class=\"tooltipTitle\">Configuration</p>Let's change the properties of this data source!",
             "type": "modal"
         }
      },
      
      {
          "wrapper": "*[ui-id=contex-form-txtName]",
          "popup": {
             "content_pt": "Nome utilizado pelo JNDI para recuperar a fonte de dados e estabelecer a conexão.",
             "content_en": "Name used by JNDI to retrieve the data source and establish the connection.",
             "type": "tooltip",
             "position": "bottom"
          }
      },
      {
          "wrapper": "*[ui-id=contex-form-txtUser]",
          "popup": {
             "content_pt": "Usuário para conexão com o banco de dados.",
             "content_en": "User for database connection.",
             "type": "tooltip",
             "position": "bottom"
          }
      },
      
      {
          "wrapper": "*[ui-id=contex-form-txtPassword]",
          "popup": {
             "content_pt": "Senha para conexão com o banco de dados.",
             "content_en": "Password for database connection.",
             "type": "tooltip",
             "position": "bottom"
          }
      },
      
      {
          "wrapper": "*[ui-id=contex-form-cmbVendor]",
          "popup": {
             "content_pt": "Escolha qual o tipo de banco de dados (Oracle, MySql, SqlServer, etc)",
             "content_en": "Choose database type (Oracle, MySql, SqlServer, etc)",
             "type": "tooltip",
             "position": "bottom"
          }
      },

      {
          "wrapper": "*[ui-id=contex-form-txtURL]",
          "popup": {
             "content_pt": "A URL de conexão especifica onde o banco de dados está e se vai acontecer alguma ação como criar banco de dados caso não exista, entre outros. Ao selecionar o tipo de banco de dados o Cronapp já monta a URL de acordo com o tipo escolhido.",
             "content_en": "The connection URL specifies where the database is and whether any action will take place such as creating a database if it does not exist, etc. When selecting the type of database Cronapp already assembles the URL according to the chosen type.",
             "type": "tooltip",
             "position": "bottom"
          }
      },
      
      {
          "wrapper": "*[ui-id=contex-form-btnAddConnection]",
          "popup": {
             "content_pt": "Uma vez que tudo esteja configurado, clique aqui para salvar sua fonte de dados.",
             "content_en": "Once everything is set, click here to save your datasource.",
             "type": "tooltip",
             "position": "top"
          }
      }
      
    ]
 }